---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.Illuminance
source: html/81ed9da9-d26f-db06-cee0-9d94e323d45c.htm
---
# Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.Illuminance Property

The illuminance intensity value.

## Syntax (C#)
```csharp
public double Illuminance { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The illuminance value is not valid because it is not between 0 and 1e+30.